{
  "home": {
    "title": "Welcome to React Lang",
    "subtitle": "Learn about the latest technologies in tech",
    "getStarted": "Get Started",
    "learnMore": "Learn More"
  },
  "ai": {
    "title": "Artificial Intelligence",
    "description": "Explore the world of AI and machine learning",
    "content": "Artificial Intelligence is the simulation of human intelligence by machines. It includes machine learning, deep learning, and natural language processing. Applications: recommendations, chatbots, predictive analysis, and intelligent automation."
  },
  "cyber": {
    "title": "Cyber Security",
    "description": "Protect your digital assets with modern security practices",
    "content": "Cyber Security protects systems, networks, and data against digital attacks. It involves firewalls, encryption, multi-factor authentication, and penetration testing. Essential for protecting sensitive information and maintaining business continuity."
  },
  "cloud": {
    "title": "Cloud Computing",
    "description": "Scale your applications with cloud infrastructure",
    "content": "Cloud computing allows you to run applications and store data on remote servers, accessible over the internet. Main providers: AWS, Azure, Google Cloud. Benefits: scalability, flexibility, reduced infrastructure costs, and high availability."
  },
  "software": {
    "title": "Software Development",
    "description": "Build robust applications with best practices",
    "content": "Software Development involves designing, coding, testing, and maintaining applications. Agile methodologies, design patterns, and clean architecture are fundamental. Popular languages: Python, JavaScript, Java, and C++."
  },
  "data": {
    "title": "Data Science",
    "description": "Analyze and visualize data for insights",
    "content": "Data Science combines statistics, programming, and business intelligence to extract insights from large volumes of data. Tools: Python, R, SQL, Power BI. Applications: predictive analysis, customer segmentation, and process optimization."
  }
}
