{
  "home": {
    "title": "Bem-vindo ao React Lang",
    "subtitle": "Aprenda sobre as últimas tecnologias em tech",
    "getStarted": "Começar",
    "learnMore": "Saiba Mais"
  },
  "ai": {
    "title": "Inteligência Artificial",
    "description": "Explore o mundo da IA e aprendizado de máquina",
    "content": "Inteligência Artificial é a simulação de inteligência humana por máquinas. Inclui machine learning, deep learning e processamento de linguagem natural. Aplicações: recomendações, chatbots, análise preditiva e automação inteligente."
  },
  "cyber": {
    "title": "Segurança Cibernética",
    "description": "Proteja seus ativos digitais com práticas modernas de segurança",
    "content": "Segurança Cibernética protege sistemas, redes e dados contra ataques digitais. Envolve firewalls, criptografia, autenticação multi-fator e testes de penetração. Essencial para proteger informações sensíveis e manter a continuidade dos negócios."
  },
  "cloud": {
    "title": "Computação em Nuvem",
    "description": "Dimensione suas aplicações com infraestrutura em nuvem",
    "content": "A computação em nuvem permite que você execute aplicações e armazene dados em servidores remotos, acessíveis pela internet. Principais provedores: AWS, Azure, Google Cloud. Benefícios: escalabilidade, flexibilidade, redução de custos com infraestrutura e alta disponibilidade."
  },
  "software": {
    "title": "Desenvolvimento de Software",
    "description": "Construa aplicações robustas com as melhores práticas",
    "content": "Desenvolvimento de Software envolve design, codificação, teste e manutenção de aplicações. Metodologias ágeis, padrões de design e arquitetura limpa são fundamentais. Linguagens populares: Python, JavaScript, Java e C++."
  },
  "data": {
    "title": "Ciência de Dados",
    "description": "Analise e visualize dados para obter insights",
    "content": "Ciência de Dados combina estatística, programação e business intelligence para extrair insights de grandes volumes de dados. Ferramentas: Python, R, SQL, Power BI. Aplicações: análise preditiva, segmentação de clientes e otimização de processos."
  }
}
